Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_FoundationLibraryRef/FoundationLibraryReference-level2.tmx
Source language: en_us
Languages: ja

source: Once it has acquired the lock and executed the critical section of code, the thread can relinquish the lock and set the associated condition to something new.
ja: いったんそれがロック状態を獲得してコードのクリティカルセクションを実行してしまったならば、スレッドはロック状態を放棄して関連付けられた条件を何か新しいものへと設定することができます。

source: Once the predicate returns false it will not be called again.
ja: いったん述部がfalseを返すならそれは再び呼び出されません。

source: One common context where you might call this method and end up registering with a runloop that is not automatically run on a regular basis is when being invoked by a dispatch queue.
ja: あなたがこのメソッドを呼び出して自動的には通常の原則上で動かされない実行ループに登録することに終わるかもしれないよくある文脈は、ディスパッチキューによって発動されている時です。

source: One of the hostnames of the receiver.
ja: レシーバのホスト名の１つ。

source: One of the network address for the receiver.
ja: レシーバに対するネットワークアドレスの１つ。

source: One past the index of the last node in the index path.
ja: インデックスパスの最後のノードのインデックスを１つ過ぎます。

source: Only frameworks with one or more Objective-C classes in them are included.
ja: １つ以上のObjective-Cクラスを持つフレームワークだけが含められます。

source: Only the volume of this parameter is used.
ja: このパラメータのボリューム名だけが使われます。

source: Only valid for Version 1 cookies and later.
ja: ただ Version 1 クッキー以降に対してだけ有効です。

source: Only valid for Version 1 cookies or later.
ja: ただ Version 1 クッキーまたは以降にだけ有効です。

source: Operating on a File
ja: ファイルに関する操作

source: Operations
ja: さまざまな演算

source: Operator
ja: 演算子

source: Operator Functions
ja: 演算子関数

source: Operators
ja: 様々な演算子

source: Option flags for reading the node located at url.
ja: urlに位置するノードを読み出すためのオプションフラグ。

source: Option flags for the enumeration.
ja: 列挙に対する任意のフラグ

source: Option flags for writing to the node located at url.
ja: urlに位置するノードに書き出すためのオプションフラグ。

source: Options
ja: オプション

source: Options for block enumeration operations.
ja: ブロック列挙演算のためのオプション。

source: Options for block sorting operations.
ja: ブロックソート演算のためのオプション。

source: Options for enumerating mounted volumes with the mounted Volume URLs(including Resource Values For Keys: options:) method.
ja: マウントされたボリュームをmounted Volume URLs(including Resource Values For Keys: options:)メソッドで列挙することに対するオプション。

source: Options for enumerating the contents of directories with the contents Of Directory(at: including Properties For Keys: options:) method.
ja: ディレクトリの内容をcontents Of Directory(at: including Properties For Keys: options:)メソッドで列挙することに対するオプション。

source: Options for generating and parsing ISO 8601 date representations.
ja: ISO 8601日付表現を生成および構文解析するためのオプション。

source: Options for method used to search data objects.
ja: データオブジェクトの検索に使用されるメソッドのオプション。

source: Options for methods used to Base64 encode data.
ja: データをBase64エンコードするために使用されるメソッドのオプション。

source: Options for methods used to read data objects.
ja: データオブジェクトの読み出しに使用されるメソッドのオプション。

source: Options for methods used to write data objects.
ja: データオブジェクトの書き込みに使用されるメソッドのオプション。

source: Options for the enumeration.
ja: 列挙に対するオプション。

source: Options for the read operation.
ja: 読み込み操作に対するオプション。

source: Options for the search.
ja: 検索のオプション。

source: Options for writing the data.
ja: データ書き込みのためのオプション。

source: Options that control a data search operation.
ja: データ検索演算を制御するオプション。

source: Options to control the reading of data from a URL.
ja: あるURLからのデータ読み込みを制御するためのオプション。

source: Options to control the writing of data to a URL.
ja: あるURLへのデータ書き込みを制御するためのオプション。を

source: Options to modify the decoding algorithm used to decode Base64 encoded data.
ja: Base64エンコードされたデータをデコードするために使われるデコードアルゴリズムを修正するオプション。

source: Options to use when decoding data.
ja: データをデコードする時に使うオプション。

source: Options to use when encoding data.
ja: データをエンコードする時に使うオプション。

source: Options used to generate and parse ISO 8601 date representations.
ja: ISO 8601日付表現を生成および構文解析するために使用するオプション。

source: Ordinal Day of Year
ja: 年内日にち番号

source: Other initializers (including casting using as Data) may choose to hold a reference or not, based on a what is the most efficient representation.
ja: 他のイニシャライザ（as Dataを使ってキャストすることを含む）は、何が最も効率的な表現であるかに基づいて、参照を保持するかしないかを選ぶかもしれません。

source: Other methods are no-ops or return “sensible” values.
ja: 他のメソッドは、ノーオペレーションか「分別ある」値を返します。

source: Other methods, including descriptor With Descriptor Type: bytes: length: make it possible to create and initialize instances of NSApple Event Descriptor without creating temporary instances of NSData.
ja: 他のメソッドは、descriptor With Descriptor Type: bytes: length:を含めて、NSApple Event DescriptorのインスタンスをNSDataの一時な仮のインスタンスを作成することなしに作成および初期化できるようにします。

source: Otherwise fatal Error is called.
ja: そうでなければfatal Errorが呼び出されます。

source: Otherwise does nothing.
ja: そうでなければ何もしません。

source: Otherwise it may return one of the following values: NSCalculation Loss Of Precision, NSCalculation Overflow or NSCalculation Underflow.
ja: そうでなければそれは以下の値の１つを返すでしょう：NSCalculation Loss Of Precision、NSCalculation OverflowまたはNSCalculation Underflow。

source: Otherwise the result always tries to show at least three significant digits, introducing fraction digits as necessary.
ja: そうでなければ結果は、小数桁を必須のものとして導入して、常に少なくとも３小数桁を示そうとします。

source: Otherwise, DDD is used.
ja: そうでなければ、DDDが使われます。

source: Otherwise, yyyy is used.
ja: そうでなければ、yyyyが使われます。

source: Otherwise, returns (false, old Member), where old Member is the member of the set equal to new Member.
ja: そうでなければ、(false, old Member)を返します、そこでold Memberはnew Memberに等しいこの集合のメンバです。

source: Otherwise, the cookie is only sent to ports specified in the port list.
ja: そうでなければ、クッキーはポートリストにおいて指定されたポートに送られるだけです。

source: Otherwise, the existing instance is returned.
ja: そうでなければ、既存のインスタンスが返されます。

source: Otherwise, the index of the first matching object is returned.
ja: そうでなければ、最初の合致するオブジェクトのインデックスが返されます。

source: Outlets to top-level objects should be strong references to demonstrate ownership and prevent deallocation.
ja: トップレベルのオブジェクトへのアウトレットは、所有権を誇示してデアロケーションを防ぐために、強い参照であるべきです。

source: Output from NSLogv is serialized, in that only one thread in a process can be doing the writing/logging described above at a time.
ja: NSLogvからの出力はシリアライズされます、あるプロセスの中のただ１つのスレッドだけが、上で記述される「書き出し／ログ実行」を一度に行うことができるという点において。

source: Overridden by subclasses to forward messages to other objects.
ja: これは、メッセージを別のオブジェクトへ転送するためにサブクラスによってオーバーライドされます。

source: Overridden by subclasses to substitute a class other than its own during coding.
ja: サブクラスによってオーバーライドされて、コーディングの間にそれ自身とは違うあるクラスに置き換えるようにされます。

source: Overridden by subclasses to substitute a new class during keyed unarchiving.
ja: サブクラスによってオーバーライドされて、キー付きアンアーカイブの間に新しいクラスの代理を務めます。

source: Overridden by subclasses to substitute another object for itself during archiving.
ja: サブクラスによってオーバーライドされて、アーカイブの間に別のオブジェクトをそれ自身の代わりにします。

source: Overridden by subclasses to substitute another object for itself during encoding.
ja: サブクラスによってオーバーライドされて、エンコーディングの間に別のオブジェクトをそれ自身の代わりにします。

source: Overridden by subclasses to substitute another object for itself during keyed archiving.
ja: サブクラスによってオーバーライドされて、キー付きアーカイブの間に別のオブジェクトをそれ自身の代わりにします。

source: Overridden by subclasses to substitute another object in place of the object that was decoded and subsequently received this message.
ja: サブクラスによってオーバーライドされて、デコードされた後このメッセージを受け取ったオブジェクトに代わって別のオブジェクトが代理を務めるようにされます。

source: Overridden to return the names of classes that can be used to decode objects if their class is unavailable.
ja: それらオブジェクトをデコードするために使われることが出来るクラスの名前を、それらのクラスが利用可能でないならば返すようにオーバーライドされます。

source: Overrides the specified attribute in the receiver or adds it if it does not exist, and sets its value to the specified value.
ja: 指定された属性をレシーバにおいてオーバーライドします、またはそれが存在しないならばそれを追加します、そしてそれの値を指定された値に設定します。

source: Overview
ja: 概要

source: Parameters
ja: パラメータ

source: Parse XML documents.
ja: XML文書の構文解析。

source: Pass nil if the method does not take an argument.
ja: メソッドが引数を取らないならばnilを渡してください。

source: Pass true to request that the collection avoid releasing its storage.
ja: trueを渡して、コレクションがそのストレージを解放するのを回避するよう要求してください。

source: Pass nil to match a request for nil that was originally passed as the argument.
ja: 元々引数として渡されたのがnilであるある要請と一致させるにはnilを渡してください。

source: Pass NULL if you do not want error information.
ja: NULLをあなたがエラー情報を望まないならば渡してください。

source: Pass NULL if you do not need this information.
ja: あなたがこの情報を必要としないならばNULLを渡してください。

source: Pass the greater-than operator (>) operator as the predicate.
ja: より大きい（>）演算子を述部として渡してください。

source: Passed to the File Manager method url(for: in: appropriate For: create:) in order to create a temporary directory.
ja: File Managerのメソッドurl(for: in: appropriate For: create:) に一時ディレクトリを作成するために渡されます。

source: Passing nil results in an Apple event descriptor that has no key Address Attr attribute (it is valid for an Apple event to have no target address attribute).
ja: nilを渡すことは、key Address Attr属性を持たないアップルイベント記述子という結果になります（目標アドレス属性を持たないことはアップルイベントに対して有効です）。

source: Passing a directory and domain pair that makes no sense (for example desktop Directory and network Domain Mask) raises an exception.
ja: 意味をなさないディレクトリと領域の組（例えばdesktop Directoryとnetwork Domain Mask）を渡すことは、例外を引き起こします。

source: Passing a sequence with no elements or an empty collection as possible Prefix always results in true.
ja: １つの要素もないシーケンスまたは空のコレクションをpossible Prefixとして渡すことは、常にtrueという結果になります。

source: Passing the collection’s end Index as the start parameter results in an empty subsequence.
ja: コレクションのend Indexをstartパラメータとして渡すことは、空のシーケンスという結果になります。

source: Passing the collection’s starting index as the end parameter results in an empty subsequence.
ja: コレクションの開始インデックスをendパラメータとして渡すことは、空のシーケンスという結果になります。

source: Pathname of the file-system node the file wrapper is to represent.
ja: ファイルラッパーが表すことになる、ファイルシステムノードのパス名。

source: Pathname of the file-system node to which the receiver’s contents are written.
ja: ファイルシステムノードのパス名、それに対してレシーバの持つ内容が書き込まれます。

source: Pathname the file wrapper references (the destination of the symbolic link the file wrapper represents).
ja: ファイルラッパーが参照するパス名（ファイルラッパーが表すシンボリックリンクの行き先）。

source: Pathname the new symbolic-link file wrapper is to reference.
ja: 新しいシンボリックリンクファイルラッパーが参照することになるパス名。

source: Pathname the receiver is to represent.
ja: レシーバが表すことになるパス名。

source: Pattern Matching
ja: パターンマッチング

source: Perform a shallow enumeration; do not descend into directories.
ja: 浅い列挙を実行します；ディレクトリの中へと下りません。

source: Performance
ja: 性能

source: Performing Arithmetic
ja: 算術の実行

source: Performing Arithmetic Using References
ja: 参照を使って算術を実行する

source: Performing comparisons
ja: 比較を実行する

source: Performs a deep enumeration of the specified directory and returns the paths of all of the contained subdirectories.
ja: 指定されたディレクトリの深い列挙を実行します、そして全ての含まれる下位ディレクトリのパスを返します。

source: Performs a salient action.
ja: ある際立ったアクションを実行します。

source: Performs a shallow copy of the specified hash table.
ja: 指定されたハッシュテーブルの浅いコピーを実行します。

source: Performs a shallow copy of the specified map table.
ja: 指定されたマップテーブルの浅いコピーを実行します。

source: Performs a shallow search of the specified directory and returns URLs for the contained items.
ja: 指定されたディレクトリの浅い検索を実行して、含まれる項目に対するURLを返します。

source: Performs a shallow search of the specified directory and returns the paths of any contained items.
ja: 指定されたディレクトリの浅い検索を実行して、あらゆる含まれる項目のパスを返します。

source: Performs a type conversion.
ja: 型変換を実行します。

source: Performs linguistic analysis on the specified string by enumerating the specific range of the string, providing the Block with the located tags.
ja: 言語学的分析を指定された文字列上で文字列の特定の範囲を列挙することによって実行します、位置決めタグを持つBlockを提供します。

source: Performs the action associated with the specified action.
ja: 指定されたアクションに関連付けられるアクションを実行します。

source: Permissions are set according to the umask of the current process.
ja: 権限は、現在のプロセスのumaskに応じて設定されます。

source: Persistently store domain-scoped pieces of information used to configure your app.
ja: あなたのアプリを設定するために使われる情報のドメインスコープの断片を永続的に格納します。

source: Point-in-rectangle functions generally assume that the bottom edge of a rectangle is outside of the rectangle boundaries, while the upper edge is inside the boundaries.
ja: 「ポイントイン矩形」関数は、一般的に、矩形の下端が矩形境界の外側である、一方で上端は境界の内側であることを仮定します。

source: Point-in-rectangle functions generally assume that the “upper” and “left” edges of a rectangle are inside the rectangle boundaries, while the “lower” and “right” edges are outside the boundaries.
ja: 「ポイントイン矩形」関数は、一般的に、矩形の「上」と「左」端が矩形境界の内側である、一方で「下」と「右」端は境界の外側であることを仮定します。

source: Pointer Collections
ja: ポインタコレクション

source: Possessive Match.
ja: 欲張りマッチ。

source: Possessive match.
ja: 欲張りマッチ。

source: Possible values are between 0 .0 and 1 .0.
ja: 可能な値は、0 .0と1 .0の間です。

source: Possible values are between 0 .0 and 1 .0
ja: 可能な値は、0 .0と1 .0の間です

source: Posted by NSApple Event Manager before it first dispatches an Apple event.
ja: NSApple Event Managerによって、最初にそれがあるアップルイベントを発送（ディスパッチ）する前に投稿されます。

source: Posting Notifications
ja: 通知を投函する

source: Posting a distributed notification is an expensive operation.
ja: 分散通知を投函することは、高くつく業務です。

source: Potential errors returned are in the Cocoa error domain and include the types that follow.
ja: 返される可能性のあるエラーは、Cocoaエラードメインの中にあり、以下の型を含みます。

source: Precondition: !self .is Empty.
ja: 前提条件：!self .is Empty。

source: Precondition: duration >= 0
ja: 前提条件：duration >= 0

source: Precondition: end >= start
ja: 前提条件：end >= start

source: Precondition: range must be in the bounds of the Data.
ja: 前提条件：rangeはDataの領域の中でなければなりません。

source: Precondition: The bounds of subrange must be valid indices of the collection.
ja: 前提条件：このsubrangeの境界は、コレクションの有効なインデックスでなければなりません。

source: Prefer one.
ja: １を優先して選びます。

source: Prefer zero.
ja: ゼロを優先します。

source: Preferences
ja: 環境設定

source: Preferred filename for the new regular-file file wrapper.
ja: 新しい通常ファイルファイルラッパーに対する優先ファイル名。

source: Preferred filename for the new symbolic-link file wrapper.
ja: 新しいシンボリックリンクファイルラッパーに対する優先ファイル名。

source: Preferred filenames of children are not preserved when you write a file wrapper to disk and then later instantiate another file wrapper by reading the file from disk.
ja: 子らの優先ファイル名は、あなたがあるファイルラッパーをディスクに書き出して、それから後でそのファイルをディスクから読み出すことによって別のファイルラッパーをインスタンス化する場合に、保全されません。

source: Prepares the collection to store the specified number of elements, when doing so is appropriate for the underlying type.
ja: 指定された数の要素を格納するようにコレクションを準備します、そうすることが基礎をなす型に対して適切である場合には。

source: Prepends the specified matrix to the receiver’s matrix.
ja: 指定された行列をレシーバの行列の先頭に加えます。

source: Principal Attributes
ja: プリンシパル属性

source: Prior to OS X v10.7 and iOS 5, canonicalization occurred for all header fields.
ja: OS X 10.7およびiOS 5以前では、正規化はすべてのヘッダフィールドに対して発生しました。

source: Prior to OS X version 10.5, code could not be unloaded once loaded, and this method would always return false.
ja: OS X バージョン10.5以前、コードは一旦ロードされるとアンロードされることができませんでした、そしてこのメソッドは常にfalseを返すでしょう。

source: Prior to OS X v10.6, the implementation of this method in both Number Formatter and Date Formatter would return true and an object value even if only part of the string could be parsed.
ja: OS X 10.6より前、このメソッドの実装はNumber FormatterとDate Formatterの両方において、trueおよびあるオブジェクト値を返します、たとえ文字列の一部が構文解析されただけであるとしてもです。

source: Prior to copying an item, the file manager asks its delegate if it should actually do so for each item.
ja: ある項目をコピーするに先だって、ファイルマネージャは、それが各項目に対して実際にそうするべきかそれの委任先に尋ねます。

source: Prior to copying each item, the file manager asks its delegate if it should actually do so.
ja: 各項目をコピーするに先だって、ファイルマネージャは、それが実際にそうするべきかそれの委任先に尋ねます。

source: Prior to iOS 7, the method was implemented as private API, but that implementation called the does Not Recognize Selector(_:) method.
ja: iOS 7より前は、このメソッドはプライベートAPIとして実装されました、しかしその実装はdoes Not Recognize Selector(_:)メソッドを呼び出しました。

source: Prior to linking each item, the file manager asks its delegate if it should actually create the link.
ja: 各項目をリンクするに先だって、ファイルマネージャは、それが実際にリンクを作成するべきかそれの委任先に尋ねます。

source: Prior to moving the item, the file manager asks its delegate if it should actually move it.
ja: 項目を移動するに先だって、ファイルマネージャは、それが実際にそれを移動するべきかそれの委任先に尋ねます。

source: Prior to removing each item, the file manager asks its delegate if it should actually do so.
ja: 各項目を削除するに先だって、ファイルマネージャは、それが実際にそうするべきかそれの委任先に尋ねます。

source: Processes and Threads
ja: プロセスとスレッド

source: Property Lists
ja: プロパティ・リスト

source: Protocols
ja: 様々なプロトコル

source: Protocols are adopted by listing them within angle brackets after the interface declaration.
ja: プロトコルは、インターフェイス宣言の後に山形括弧の中にそれらを列記することによって採用されます。

source: Protocols incorporate other protocols in the same way classes adopt them.
ja: プロトコルは、クラスがそれらを採用するのと同じ方法で他のプロトコルを取り入れます。

source: Provided by Apple—can’t be modified (/System) .
ja: Appleによって提供されます — 修正できません（/System）。

source: Provides the pathname referenced by the file wrapper object, which must be a symbolic-link file wrapper.
ja: ファイルラッパーオブジェクト、それはシンボリックリンクファイルラッパーである必要があります、によって参照されるパス名を提供します。

source: Providing any value for this key indicates that the cookie should remain secure.
ja: このキーに対して何らかの値を提供することは、クッキーが安全なままであるべきなのを指し示します。

source: Publicly available location in the local area network—the place to install items available on the network (/Network).
ja: ローカルエリアネットワークにおいて公共的に利用可能な場所 — ネットワーク上で利用可能な項目をインストールする場所（/Network）。

source: Purgeable Collections
ja: パージ可能なコレクション

source: Puts the file pointer at the end of the file referenced by the receiver and returns the new file offset.
ja: ファイルポインタをレシーバによって参照されるファイルの終端に置きます、そして新しいファイルオフセットを返します。

source: Querying File Wrappers
ja: ファイルラッパーに問い合わせる

source: Querying an Array
ja: 配列に問い合わせる

source: Quotes all following characters until \E.
ja: \Eまで全ての以降の文字を引用します。

source: Quotes the following character.
ja: 続く文字を引用します。

source: Radioactivity is also commonly described in terms of curies (Ci), a unit defined relative to the decay of one gram of the radium-226 isotope (1 Ci = 3.7 × 1010 Bq).
ja: 放射能はまた、よくキュリー（Ci）、１グラムのラジウム226同位体の崩壊に関して定義される単位に基づいて記述されます（1 Ci = 3.7 × 1010 Bq）。

source: Radioactivity is the process by which the nucleus of an atom emits radiation.
ja: 放射能は、原子核が放射線を発する一連の作用です。

source: Raised by NSFile Handle if attempts to determine file-handle type fail or if attempts to read from a file or channel fail.
ja: NSFile Handleによって、ファイルハンドル型を決定する試みが失敗するならばまたはファイルまたは経路から読み込む試みが失敗するならば、引き起こされます。

source: Raises NSInvalid Argument Exception if key is equal to the not AKey Marker field of the table’s NSMap Table Key Call Backs structure.
ja: NSInvalid Argument Exceptionが引き起こされます、もしテーブルのもつNSMap Table Key Call Backs構造体のkeyがnot AKey Markerフィールドと等しいならば。

source: Raises number to power, possibly rounding off according to rounding Mode, and stores the resulting value in result.
ja: numberをpower乗します、可能ならばrounding Modeに従って丸めて、結果の値をresultに格納します。

source: Raises an range Exception if any location in indexes exceeds the bounds of the array, indexes is nil.
ja: indexesの中の何らかの位置が配列の境界を超える、indexesがnilならば、range Exceptionを引き起こします、

source: Raises an exception if the message is sent to a file handle representing a pipe or socket or if the file descriptor is closed.
ja: メッセージがパイプまたはソケットを表しているファイルハンドルを送られるならば、またはファイル記述子が閉じられるならば、例外を引き起こします。

source: Raises an exception if the message is sent to an NSFile Handle object representing a pipe or socket or if the file descriptor is closed.
ja: パイプまたはソケットを表しているNSFile Handleオブジェクトにメッセージが送られるならば、またはファイル記述子が閉じられるならば、例外を引き起こします。

source: Raises an exception if the message is sent to an NSFile Handle object representing a pipe or socket, if the file descriptor is closed, or if any other error occurs in seeking.
ja: パイプまたはソケットを表しているNSFile Handleオブジェクトにメッセージが送られるならば、ファイル記述子が閉じられるならば、または何らかの他のエラーがシークにおいて発生するならば、例外を引き起こします。

source: Raises an exception.
ja: 例外を引き起こします。

source: Raises the decimal value to the specified power.
ja: 10進法値を指定累乗します。

source: Range of input that matched the parenthesized subexpression is available after the match.
ja: 括弧に入れられた正規表現部分にマッチした入力の範囲は、マッチ終了後に利用できます。

source: Ranges
ja: さまざまな範囲

source: Read Data from Arrays
ja: 配列からデータを読み出す

source: Read error because no such file was found.
ja: そのようなファイルが見つからなかったのが原因での読み込みエラー。

source: Read error because of a corrupted file, bad format, or similar reason.
ja: 破損ファイル、不正なフォーマット、または同様な理由が原因での読み込みエラー。

source: Read error because of a permission problem.
ja: 権限問題が原因での読み込みエラー。

source: Read error because of an invalid file name.
ja: 無効なファイル名が原因での読み込みエラー。

source: Read error because the specified URL scheme is unsupported.
ja: 指定されたURLスキームがサポートされないのが原因での読み込みエラー。

source: Read error because the specified file was too large.
ja: 指定されたファイルが大きすぎたのが原因での読み込みエラー。

source: Read error because the string coding of the file could not be determined.
ja: ファイルの文字列コーディングが特定できなかったのが原因での読み込みエラー。

source: Read error because the string encoding was not applicable.
ja: 文字列エンコーディングが適用できなかったのが原因での読み込みエラー。

source: Read error, reason unknown.
ja: 読み込みエラー、理由不明。

source: Read messages sent to a null-device file handle return an end-of-file indicator (an empty NSData object) rather than raise an exception.
ja: nullデバイスファイルハンドルに送られた読み込みメッセージは、ファイル終端指示子（空のNSDataオブジェクト）を返します、例外を引き起こすのではなく。

source: Reading and Writing Data
ja: Dataの読み書き

source: Reading and Writing Using Blocks
ja: ブロックを使う読み書き

source: Reading from a File Handle
ja: ファイルハンドルから読み込む

source: Reading options that can be set by the init(url: options:) and read(from: options:) methods.
ja: init(url: options:)とread(from: options:)メソッドによって設定されることが可能である読み出しオプション。

source: Reads from the file or communications channel in the background and posts a notification when finished.
ja: バックグラウンドにおいてファイルまたは通信経路から読み込みます、そして終了した時ある通知を投函します。

source: Reads to the end of file from the file or communications channel in the background and posts a notification when finished.
ja: バックグラウンドにおいてファイルまたは通信経路からファイルの終端まで読み込みます、そして終了した時にある通知を投函します。

source: Reads up to a given number of bytes into a given buffer.
ja: 与えられたバイト数まで与えられたバッファに読み出します。

source: Reallocates collectable memory.
ja: 収集可能なメモリを再アロケートします。

source: Recall that a colon (“:”) is part of a method name; set Height is not the same as set Height:.
ja: コロン（“:”）はメソッド名の一部部あることを思い出してください；set Heightはset Height:と同じではありません。

source: Recognize common error codes generated by file system operations.
ja: ファイルシステム演算によって生成される一般的エラーコードを識別する。

source: Recursively rereads the entire contents of a file wrapper from the specified location on disk.
ja: ディスク上の指定された場所から、ファイルラッパーの全内容を再帰的に再読み込みします。

source: Recursively writes the entire contents of a file wrapper to a given file-system URL.
ja: 与えられたファイルシステムURLへと、ファイルラッパーの全内容を再帰的に書き込みます。

source: Redundant invocations of set Current Apple Event And Reply Event With Suspension ID(_:) are ignored.
ja: set Current Apple Event And Reply Event With Suspension ID(_:)の冗長な発動は無視されます。

source: Redundant invocations of resume(with Suspension ID:) are ignored.
ja: resume(with Suspension ID:)の冗長な発動は無視されます。

source: Reference Types
ja: 参照型

source: Region-specific localized resources (based on the user’s region preferences)
ja: 地域特定のローカライズされたリソース（ユーザの地域環境設定に基づいて）

source: Registering for Observation
ja: 監視のために登録する

source: Registers a given object (typically a class) to handle coercions (conversions) from one given class to another.
ja: 与えられたオブジェクト（概してあるクラス）を登録して、ある与えられたクラスから別のものへの強制（変換）を取り扱うようにします。

source: Registers an object to receive a notification with a specified behavior when notification delivery is suspended.
ja: 通知配達が待機させられる場合に指定される挙動とともに、オブジェクトを登録して通知を受け取るようにします。

source: Registers the Apple event handler specified by handler for the event specified by event Class and event ID.
ja: handlerで指定されるアップルイベントハンドラーを、event Classとevent IDで指定されるイベントに対して登録します。

source: Registers the observer object to receive KVO notifications for the key path relative to the object receiving this message.
ja: オブザーバーオブジェクトを登録して、このメッセージを受け取っているオブジェクトに相対的なキーパスに関するKVO通知を受け取るようにします。

source: Regular Expression Metacharacters
ja: 正規表現メタ文字

source: Regular Expression Operators
ja: 正規表現演算子

source: Regular Expression Syntax
ja: 正規表現構文

source: Regular file
ja: 一般ファイル
